Repository: unicam-webmva/webmva
Catalog: Programmi/wapiti/wapitiCore/language_sources/*.po
Languages: de

source: Evil url: {0}
de: Böse URL: {0}

source: {0} in {1} via injection in the parameter {2}
de: {0} in {1} durch Injektion in den Parameter {2}

source: coming from {0}
de: von {0} kommend

source: {0} in {1} via injection in the query string
de: {0} in {1} durch Injektion in den Query-String

source: {0} in {1} via injection in the resource path
de: {0} in {1} durch Injektion in den Ressourcenpfad

source: Involved parameter: {0}
de: Betreffender Parameter: {0}

source: Evil request:
de: Böse Anfrage:

source: SQL Injection
de: SQL Injektion

source: Blind SQL Injection
de: Blinde SQL Injektion

source: File Handling
de: Dateihandhabung

source: Commands execution
de: Befehlsausführung

source: Htaccess Bypass
de: Htaccess Überwindung

source: Backup file
de: Sicherungsdatei

source: Potentially dangerous file
de: Möglicherweise gefährliche Datei

source: Internal Server Error
de: Interner Server Fehler

source: Resource consumption
de: Ressourcenverbrauch

source: Received a HTTP 500 error in {0}
de: HTTP Fehler 500 erhalten in {0}

source: Timeout occured in {0}
de: Zeitlimit überschritten in {0}

source: The request timed out while attempting to inject a payload in the query string
de: Zeitüberschreitung der Anfrage beim Versuch ein Payload in den Query-String zu injizieren

source: The request timed out while attempting to inject a payload in the resource path
de: Zeitüberschreitung der Anfrage beim Versuch ein Payload in den Ressourcenpfad zu injizieren

source: The request timed out while attempting to inject a payload in the parameter {0}
de: Zeitüberschreitung der Anfrage beim Versuch ein Payload in den Parameter {0} zu injizieren

source: The server responded with a 500 HTTP error code while attempting to inject a payload in the query string
de: Der Server antwortete mit einem HTTP-Fehlercode 500 beim Versuch ein Payload in den Query-String zu injizieren

source: The server responded with a 500 HTTP error code while attempting to inject a payload in the resource path
de: Der Server antwortete mit einem HTTP-Fehlercode 500 beim Versuch ein Payload in den Ressourcenpfad zu injizieren

source: The server responded with a 500 HTTP error code while attempting to inject a payload in the parameter {0}
de: Der Server antwortete mit einem HTTP-Fehlercode 500 beim Versuch ein Payload in den Parameter {0} zu injizieren

source: Invalid argument for option {0} : {1}
de: Ungültiger Parameter für die Option {0} : {1}

source: [*] Loading modules:
de: [*] Lade Module:

source: No links or forms found in this page !
de: Keine Links oder Formulare auf der Seite gefunden !

source: Make sure the url is correct.
de: Prüfen Sie, ob die URL korrekt ist.

source: [!] Missing dependecies for module {0}:
de: [!] Fehlende Abhängigkeiten für Modul {0}:

source: [+] Launching module {0}
de: [+] Starte Modul {0}

source: Upload scripts found:
de: Upload-Skripte gefunden:

source: Report
de: Bericht

source: A report has been generated in the file {0}
de: Ein Bericht wurde in der Datei {0} erzeugt

source: Open {0} with a browser to see this report.
de: Öffnen Sie {0} in einem Browser um diesen Bericht zu sehen.

source: File {0} loaded. Wapiti will use it to perform the attack
de: Datei {0} geladen. Wapiti wird sie nutzen, um den nächsten Angriff durchzuführen

source: error: {0} while attacking {1}
de: Fehler: {0} während des Angriffs auf {1}

source: error: timeout while attacking {0}
de: Fehler: Zeitüberschreitung während des Angriffs auf {0}

source: + attack_post {0} from {1}
de: + attack_post {0} von {1}

source: Found backup file !
de: Sicherungsdatei gefunden !

source: Backup file {0} found for {1}
de: Sicherungsdatei {0} gefunden für {1}

source: Blind SQL vulnerability
de: Blinde SQL-Injektion

source: {0} via injection in the query string
de: {0} durch Injektion in den Query-String

source: {0} via injection in the parameter {1}
de: {0} durch Injektion in den Parameter {1}

source: CRLF Injection
de: CRLF-Injektion

source: Error: The server did not understand this request
de: Fehler: Der Server hat die Anfrage nicht verstanden

source: Command execution
de: Befehlsausführung

source: PHP evaluation
de: PHP-Interpretation

source: Warning exec
de: Warnung exec

source: preg_replace injection
de: preg_replace-Injektion

source: Warning usort()
de: usort()-Warnung

source: Warning assert
de: Assert-Warnung

source: Evalutation warning
de: Evaluations-Warnung

source: Remote inclusion vulnerability
de: Entfernte Datei-Inklusions-Schwachstelle

source: Linux local file disclosure vulnerability
de: Linux lokale Datei-Disclosure Schwachstelle

source: BSD local file disclosure vulnerability
de: BSD lokale Datei-Disclosure Schwachstelle

source: Windows local file disclosure vulnerability
de: Windows lokale Datei-Disclosure Schwachstelle

source: File disclosure vulnerability in include_path
de: Datei-Disclosure Schwachstelle im include_path

source: highlight_file() vulnerability in basedir
de: highlight_file() Schwachstelle im basedir

source: include() of file in include_path
de: include() von Datei im include_path

source: Possible {0} vulnerability
de: Mögliche {0} Schwachstelle

source: HtAccess protection found: {0}
de: HtAccess Schutz gefunden: {0}

source: Source code:
de: Quellcode:

source: .htaccess bypass vulnerability: {0}
de: .htaccess bypass-Schwachstelle: {0}

source: Problem with local nikto database.
de: Problem mit der lokalen nikto-Datenbank.

source: Downloading from the web...
de: Lade aus dem Web herunter...

source: Error downloading Nikto database
de: Fehler beim Herunterladen der Nikto-Datenbank

source: References:
de: Referenzen:

source: Stored XSS vulnerability
de: Persistente XSS-Schwachstelle

source: Found permanent XSS in {0} with {1}
de: Persistentes XSS gefunden in {0} mit {1}

source: Found permanent XSS attacked by {0} with fields {1}
de: Persistentes XSS gefunden, angegriffen durch {0} mit den Feldern {1}

source: MySQL Injection
de: MySQL Injektion

source: MSAccess-Based SQL Injection
de: MSAccess-basierte SQL-Injektion

source: MSSQL-Based Injection
de: MSSQL-basierte Injektion

source: Java.SQL Injection
de: Java.SQL Injektion

source: PostgreSQL Injection
de: PostgreSQL Injektion

source: XPath Injection
de: XPath Injektion

source: LDAP Injection
de: LDAP Injektion

source: DB2 Injection
de: DB2 Injektion

source: Interbase Injection
de: Interbase Injektion

source: Sybase Injection
de: Sybase Injektion

source: .NET SQL Injection
de: .NET SQL Injektion

source: Acess-Based SQL Injection
de: Acess-basierte SQL Injektion

source: Oracle Injection
de: Oracle Injektion

source: XSS vulnerability
de: XSS-Schwachstelle

source: XSS vulnerability found via injection in the resource path
de: XSS-Schwachstelle gefunden durch Injektion in den Ressourcenpfad

source: XSS vulnerability found via injection in the query string
de: XSS-Schwachstelle gefunden durch Injektion in den Query-String

source: XSS vulnerability found via injection in the parameter {0}
de: XSS -Schwachstelle gefunden durch Injektion in den Parameter {0}

source: No forms found in this page !
de: Keine Formulare auf der Seite gefunden !

source: Choose the form you want to use :
de: Wählen Sie ein Formular aus :

source: Enter a number :
de: Geben Sie eine Nummer ein :

source: Please enter values for the following form:
de: Bitte geben Sie Werte für das folgende Formular ein:

source: Error getting url {0}
de: Fehler beim Abruf der URL {0}

source: First argument must be the root url !
de: Erster Parameter muss die root-URL sein !

source: Invalid protocol: {0}
de: Ungültiges Protokoll: {0}

source: Invalid link argument: {0}
de: Ungültiger Link-Parameter: {0}

source: Connection refused!
de: Verbindung abgelehnt!

source: Exception in lswww.browse: {0}
de: Ausnahme in lswww.browse: {0}

source: File {0} loaded, the scan continues:
de: Datei {0} geladen, der Scan wird fortgesetzt:

source: * URLs to browse
de: * URLs zu durchsuchen

source: * URLs browsed
de: * URLs durchsucht

source: File {0} not found, Wapiti will scan again the web site
de: Datei {0} nicht gefunden, Wapiti wird die Website noch einmal scannen

source: Notice
de: Hinweis

source: This scan has been saved in the file {0}/{1}.xml
de: Dieser Scan wurde in der Datei {0}/{1}.xml gespeichert

source: You can use it to perform attacks without scanning again the web site with the "-k" parameter
de: Sie können es nutzen, um Angriffe ohne erneuten Scan der Website mit dem "-k" Parameter durchzuführen

source: Scan stopped, the data has been savedin the file {0}/{1}.xml
de: Scan gestoppt, die Daten wurden in der Datei {0}/{1}.xml gespeichert

source: To continue this scan, you should launch Wapiti with the "-i" parameter
de: Um diesen Scan fortzusetzen, sollten Sie Wapiti mit dem "-i" Parameter starten

source: Forms Info
de: Formular-Info

source: From: {0}
de: Von: {0}

source: To: {0}
de: An: {0}

source: Upload Scripts
de: Upload-Skripte

source: Forms
de: Formulare

source: Form {0}
de: Formular {0}

source: * Method: {0}
de: * Methode: {0}

source: * Intputs:
de: * Eingabefelder:

source: * Selects:
de: * Auswahlfelder:

source: * TextAreas:
de: * Textbereiche:

source: Report for {0}
de: Bericht für {0}

source: Date of the scan : {0}
de: Datum des Scans : {0}

source: Scope of the scan : {0}
de: Suchmuster des Scans : {0}

source: Summary of vulnerabilities :
de: Zusammenfassung der Schwachstellen :

source: Evil request:
de: Bösartige Anfrage:

source: cURL command PoC : "{0}"
de: cURL Befehl PoC : "{0}"

source: Anomalies found:
de: Anomalien gefunden:

source: Attack process interrupted. To perform again the attack, lauch Wapiti with "-i" or "-k" parameter.
de: Angriffsprozess wurde unterbrochen. Um den Angriff neu zu starten, führen Sie Wapiti mit den "-i" oder "-k" Parametern aus.

source: File {0} not found. Wapiti will scan the web site again
de: Datei {0} nicht gefunden. Wapiti wird die Website erneut scannen

source: [!] Unable to find a module named {0}
de: [!] Konnte kein Modul mit dem Namen {0} finden

source: Backup file description
de: Es könnte möglich sein, Sicherungsdateien von Skripten auf dem Webserver zu finden, die der Webadmin dort abgelegt hat um eine ältere Version zu speichern oder es könnten automatisch erzeugte Sicherungsdateien der Editor-Software sein (zum Beispiel Emacs). Diese Kopien könnten interessante Informationen wie Quellcode oder Zugangsdaten enthalten

source: Backup file solution
de: Der Webadmin muss die Sicherungsdateien manuell vom Server löschen oder sie aus dem Wurzelverzeichnis entfernen. Er sollte auch seinen Editor neu konfigurieren, um automatische Sicherungen zu deaktivieren.

source: Blind SQL Injection description
de: Blinde SQL-Injection ist eine Technik, die eine Schwachstelle ausnutzt, die in der Datenbank einer Anwendung auftritt. Diese Art von Schwachstelle ist schwerer zu erkennen als einfache SQL-Inkektionen weil keine Fehlermeldungen auf der Webseite ausgegeben werden.

source: Blind SQL Injection solution
de: Um sich gegen SQL-Injektion zu schützen, sollten Nutzereingaben nicht direkt in SQL-Abfragen eingebettet werden. Stattdessen sollten Nutzereingaben 'escaped' oder gefiltert werden oder es sollten parametrisierte Abfragen verwendet werden.

source: Commands execution description
de: Dieser Angriff besteht darin, auf dem Server Befehle auszuführen. Der Angreifer versucht, diese Befehle in die Anfrageparameter zu injizieren

source: Commands execution solution
de: Bei Dateisystemaufrufen vorzugsweise ohne Nutzereingaben arbeiten

source: CRLF description
de: Der Begriff CRLF verweist auf den 'Carriage Return' (ASCII 13, \r) 'Line Feed' (ASCII 10, \n). Es wird genutzt um das Zeilende festzulegen, allerdings wird damit in heutigen häufig genutzten Betriebssystemen unterschiedlich umgegangen. Zum Beispiel: In Windows werden sowohl CR als auch LF benötigt, um ein Zeilenende festzulegen, wohingegen unter Linux/ UNIX nur ein LF benötigt wird. Diese Kombination aus CR und LF wird zum Beispiel benutzt wenn man 'Enter' auf der Tastatur drückt. Abhängig von der genutzten Anwendung weist 'Enter' diese an, eine neue Zeile zu beginnen oder um einen Befehl zu senden.

source: CRLF solution
de: Prüfen Sie die angegebenen Parameter verhindern Sie die Injektion von CRLF, indem Sie es filtern

source: Cross Site Scripting description
de: Cross-Site-Scripting (XSS) ist eine Art von Schwachstelle, die häufig in Webanwendungen gefunden wird, die es erlauben, dass Code von bösartigen Nutzern in Webseiten, die von anderen Nutzern eingesehen werden können, injiziert wird. Beispiele solcher Codes sind HTML-Codes und clientseitige Skripte.

source: Cross Site Scripting solution
de: Die Beste Art, eine Webanwendung vor XSS-Attacken zu schützen ist sicherzustellen, dass die Anwendung eine Validierung aller Header, Cookies, Query-Strings, Formularfelder und versteckter Felder durchführt. Das Kodieren von Nutzereingaben auf dem Server kann auch XSS-Schwachstellen besiegen, indem man verhindert, dass in Formularen ausführbare Skripte eingefügt werden können. Anwendungen können einen signifikanten Schutz vor JavaScript-basierten Angriffen erlangen, indem sie die folgenden Zeichen in der gesamten Ausgabe durch die entsprechenden HTML-Entities umwandeln: &lt;, &gt;, &amp;, &quot;, ', (, ), #, %, ; , +, -.

source: File Handling description
de: Dieser Angriff ist auch bekannt als 'Path Traversal' oder 'Directory Traversal', sein Ziel ist es, den Zugriff zu Dateien und Verzeichnissen, die außerhalb des Webroots liegen, zu erlangen. Der Angreifer versucht, die Verzeichnisse auf dem Webserver zu erkunden. Der Angreifer benutzt dabei einige Techniken, zum Beispiel die Manipulation der Variablen die auf Dateien verweisen mit Sequenzen von 'Punkt-Punkt-Slash (../)' und deren Variationen, um zum Wurzelverzeichnis zu wechseln und so durch das Dateisystem zu navigieren.

source: File Handling solution
de: Ziehen Sie es vor, ohne Nutzereingaben zu arbeiten, wenn Sie Systemaufrufe verwenden. Nutzen Sie besser tatsächliche Dateinamen in Templates oder Sprachdateien (z.B.: Der Wert 5 aus der Nutzereingabe = Tschechisch, anstatt zu erwarten, dass der Nutzer 'Tschechisch' übergibt). Stellen Sie sicher, dass Nutzer nicht alle Teile eines Dateipfades übergeben können - stellen Sie Ihren Pfad selbst voran. Validieren Sie Nutzereingaben, indem Sie nur gute Eingaben akzeptieren - verbessern Sie die Eingaben nicht. Nutzen Sie durch chroot geschützte Bereiche und Codezugangsrichtlinien, um einzuschränken, wo Dateien gelesen oder gespeichert werden können.

source: Htaccess bypass description
de: htaccess-Dateien werden genutzt um Zugriffe auf einige Dateien über HTTP einzuschränken. In einigen Fällen kann es möglich sein, diese Einschränkungen zu umgehen und auf diese Dateien zuzugreifen.

source: Htaccess bypass solution
de: Stellen Sie sicher, dass bei falschen Zugangsdaten jede HTTP-Methode verboten ist.

source: Internal server error description
de: Ein Fehler der es verhindert die Anfrage zu verarbeiten ist auf der Serverseite aufgetreten. Es könnte das Anzeichen einer Schwachstelle sein

source: Internal server error solution
de: Weitere Informationen über den Fehler sollten Sie in den Serverlogs finden.

source: Potentially dangerous file description
de: Eine Datei mit möglichen Schwachstellen wurde auf der Website gefunden

source: Potentially dangerous file solution
de: Stellen Sie sicher, dass das Skript auf dem neuesten Stand ist und schränken Sie den Zugriff darauf ein

source: Resource consumption description
de: Der Server brauchte eine ungewöhnlich lange Zeit, um die Anfrage zu verarbeiten. Ein Angreifer könnte diese Schwachstelle nutzen um den Server zu überladen

source: Resource consumption solution
de: Das betreffende Skript könnte Serverressourcen (CPU, Arbeitsspeicher, Netzwerk, Dateizugriff...) auf ineffiziente Weise nutzen

source: SQL Injection description
de: SQL-Injektions-Schwachstellen erlauben einem Angreifer, die Abfragen die in der Datenbank ausgeführt werden, zu verändern. Ein Angreifer könnte dann in der Lage sein, Informationen die in der Datenbank gespeichert sind auszulesen, zu verändern oder sogar seine Priviligien auf dem System zu erhöhen.

source: SQL Injection solution
de: Um sich gegen SQL-Injektion zu schützen, sollten Nutzereingaben nicht direkt in SQL-Abfragen eingebettet werden. Stattdessen sollten Nutzereingaben 'escaped' oder gefiltert werden oder es sollten parametrisierte Abfragen genutzt werden.

source: Found backup file {}
de: Backup-Datei gefunden {}

source: Slowest resources found on the web server:
de: Langsamste Ressourcen auf dem Webserver gefunden:

source: With a download speed of {0} bps:
de: Mit einer Download-Geschwindigkeit von {0} bps:

source: Warning eval()
de: Warnung eval()

source: Evaluation warning
de: Codeauswertung warnung

source: Blind command execution
de: Ausführung des Befehls blind

source: Unix local file disclosure vulnerability
de: Unix-Datei Offenlegung von lokalen Dateien
